{"basics":{"name":"Kaylea Haynes","label":"Head of Data Science","image":"","email":"","phone":"","url":"https://kayleahaynes.github.io/","summary":"An accomplished data leader with a proven track record in customer operations and cyber security.","location":{"address":"","postalCode":"","city":"Manchester","countryCode":"GB","region":""},"profiles":[{"network":"","username":"","url":""}]},"work":[{"name":"Netacea","position":"Head of data science","url":"","startDate":"2024-12-01","endDate":"","summary":"","highlights":[""]},{"name":"Netacea","position":"Lead commercial data scientist","url":"","startDate":"2022-03-14","endDate":"2024-12-01","summary":"I led the commercial data science team responsible for onboarding and maintaining bot detection solutions.","highlights":["Reduced customer onboarding time from 2-4 weeks to less than 1 hour by initiating day-zero bot detection, utilising domain agnostic models. Thus resulted in shorter sales cycles and increased team capacity for R&D projects aimed at enhancing bot detection solutions.","Developed and implemented PySpark and Databricks notebooks for labelling attacks, simulating models and tuning hyperparameters, this resulted in more efficient workflows.","Played a pivotal role in customer engagements, collaborating closely with customer success managers to navigate sales calls, renewals, and quarterly business reviews, providing technical support when required.","Worked with senior leadership to influence the data strategy, facilitating structural changes in the data team, including the introduction of more focused work streams and greater collaboration with the data analytics team.","Nurtured and supported my direct reports in data science and engineering, helping them progress to senior roles and take on their first line manager responsibilities.","Played a key role in recruiting senior data science positions and improving the hiring and onboarding process."]},{"name":"Residently","position":"Data scientist","url":"","startDate":"2020-04-01","endDate":"2022-03-14","summary":"R&D data scientist in a start up looking to provide an improved digital experience for renters.","highlights":["Developed predictive models for estimating market prices and time on market for rental properties in London. I utilised ensemble models, combining Integrated Nested Laplace Approximation for capturing spatial information and XGBoost for property features. The results of these models were made accessible to the business through Shiny dashboards.","Defined essential product metrics for the North Star dashboard, with a focus on 'monthly active users' and 'three-month retention', providing valuable insights into app usage and user engagement.","Contributed to the creation of a self-service data platform using Looker and dbt data models, empowering colleagues across the organisaction to independently access and analyse data.","I actively contributed to enhancing the data literacy of my colleagues through regular 'lunch and learns' and hands-on pairing sessions.","Played a key role in supporting the recruitment and onboarding of two strategic analysts, contributing to the expansion of the data team."]},{"name":"Peak","position":"Data scientist then lead data scientist (from 2018)","url":"","startDate":"2017-04-01","endDate":"2020-03-14","summary":"Lead data scientist for the Demand AI team.","highlights":["Facilitated the growth of the data science team from approximately 8 data scientists to 30 through streamlined recruitment processes and effective onboarding.","Assisted in the creation of Peak Ensemble, a recurring event featuring academic speakers discussing the latest developments in Data Science and Computer Science.","Cultivated a culture of learning and development within the team by orchestrating regular Peak Academies, where team members presented topics to their peers. Additionally, I established a book club within the Demand AI team, where we rotated the responsibility of presenting chapters from 'Principles of Business Forecasting'.","Formed valuable collaborations with Lancaster University and University of Manchester, resulting in the creation of internship opportunities.","Led an initiative exploring flexible working options within data science, with a particular focus on accommodating working parents through options such as part-time hours.","Managed a substantial project in partnership with a national tool hire company, creating a unique forecasting model for weekly tool requirements across 100s of depots and 1000s of product types.","Collaborated on a project with a prominent retail company to optimise warehouse routing, using a genetic algorithm approach. I spent time within the warehouse to gain firsthand insights into operations.","Contributed to presales projects across a diverse range of companies spanning retail, food and beverages, and manufacturing sectors."]}],"volunteer":[{"organization":"Start2jog","location":"Hadfield","position":"Cross country capatain","url":"","startDate":"2019-09-01","endDate":"","summary":"I organise my running clubs' participation in the Manchester Area Cross Country League.","highlights":[""]},{"organization":"parkrun, UK","location":"Manchester & Glossop","position":"Run Director","url":"","startDate":"2016-11-01","endDate":"2025-01-07","summary":"Part of core teams responsible for providing a safe and inclusive environment for runners to run 5K on a Saturday morning.","highlights":["Helped to establish Sale Water park, parkun.","Joined the core team at Glossop parkrun and served as co-event director for a couple of years","In total run directed 43 times."]}],"education":[{"institution":"Lancaster University","location":"Lancaster, UK","url":"","area":"Statistics and Operational Research","studyType":"PhD","startDate":"2012-09-01","endDate":"2016-12-01","score":"","courses":["Detecting abrupt changes in Big Data"]}],"awards":[{"title":"","date":"","awarder":"","url":"","summary":""}],"certificates":[{"name":"","date":"","issuer":"","url":"","icon":""}],"publications":[{"name":"","publisher":"","releaseDate":"","url":"","summary":""}],"skills":[{"name":"","level":"","icon":"","keywords":[]}],"languages":[{"language":"English","fluency":"Native speaker","icon":""}],"interests":[{"name":"","icon":"","keywords":[]}],"references":[{"name":"","icon":"","reference":""},{"name":"","icon":"","reference":""}],"projects":[{"name":"","summary":"","highlights":[""],"startDate":"","endDate":"","url":""}]}