{
  "basics": {
    "name": "Kaylea Haynes",
    "label": "Head of Data Science",
    "image": "",
    "email": "",
    "phone": "",
    "url": "https://kayleahaynes.github.io/",
    "summary": "An accomplished data leader with a proven track record in customer operations and cyber security.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Manchester",
      "countryCode": "GB",
      "region": ""
    },
    "profiles": [
      {
        "network": "",
        "username": "",
        "url": ""
      }
    ]
  },
  "work": [
    {
      "name": "Netacea",
      "position": "Head of data science",
      "url": "",
      "startDate": "2024-12-01",
      "endDate": "",
      "summary": ""
    }, 
    {
      "name": "Netacea",
      "position": "Lead commercial data scientist",
      "url": "",
      "startDate": "2022-03-14",
      "endDate": "2024-12-01",
      "summary": "I led the commercial data science team responsible for onboarding and maintaining bot detection solutions.",
      "highlights": ["Reduced customer onboarding time from 2-4 weeks to less than 1 hour by initiating day-zero bot detection, utilising domain agnostic models. Thus resulted in shorter sales cycles and increased team capacity for R&D projects aimed at enhancing bot detection solutions.", "Developed and implemented PySpark and Databricks notebooks for labelling attacks, simulating models and tuning hyperparameters, this resulted in more efficient workflows.", "Played a pivotal role in customer engagements, collaborating closely with customer success managers to navigate sales calls, renewals, and quarterly business reviews, providing technical support when required.", "Worked with senior leadership to influence the data strategy, facilitating structural changes in the data team, including the introduction of more focused work streams and greater collaboration with the data analytics team.", "Nurtured and supported my direct reports in data science and engineering, helping them progress to senior roles and take on their first line manager responsibilities.", "Played a key role in recruiting senior data science positions and improving the hiring and onboarding process."
     ]
    }, 
    {
      "name": "Residently",
      "position": "Data scientist",
      "url": "",
      "startDate": "2020-04-01",
      "endDate": "2022-03-14",
      "summary": "R&D data scientist in a start up looking to provide an improved digital experience for renters.",
      "highlights": ["Developed predictive models for estimating market prices and time on market for rental properties in London. I utilised ensemble models, combining Integrated Nested Laplace Approximation for capturing spatial information and XGBoost for property features. The results of these models were made accessible to the business through Shiny dashboards.", "Defined essential product metrics for the North Star dashboard, with a focus on 'monthly active users' and 'three-month retention', providing valuable insights into app usage and user engagement.", "Contributed to the creation of a self-service data platform using Looker and dbt data models, empowering colleagues across the organisaction to independently access and analyse data.", "I actively contributed to enhancing the data literacy of my colleagues through regular 'lunch and learns' and hands-on pairing sessions.", "Played a key role in supporting the recruitment and onboarding of two strategic analysts, contributing to the expansion of the data team."]
    }, 
    {
      "name": "Peak",
      "position": "Data scientist then lead data scientist (from 2018)",
      "url": "",
      "startDate": "2017-04-01",
      "endDate": "2020-03-14",
      "summary": "Lead data scientist for the Demand AI team.",
      "highlights": ["Facilitated the growth of the data science team from approximately 8 data scientists to 30 through streamlined recruitment processes and effective onboarding.",  "Assisted in the creation of Peak Ensemble, a recurring event featuring academic speakers discussing the latest developments in Data Science and Computer Science.",  "Cultivated a culture of learning and development within the team by orchestrating regular Peak Academies, where team members presented topics to their peers. Additionally, I established a book club within the Demand AI team, where we rotated the responsibility of presenting chapters from 'Principles of Business Forecasting'.",  "Formed valuable collaborations with Lancaster University and University of Manchester, resulting in the creation of internship opportunities.",  "Led an initiative exploring flexible working options within data science, with a particular focus on accommodating working parents through options such as part-time hours.",  "Managed a substantial project in partnership with a national tool hire company, creating a unique forecasting model for weekly tool requirements across 100s of depots and 1000s of product types.",  "Collaborated on a project with a prominent retail company to optimise warehouse routing, using a genetic algorithm approach. I spent time within the warehouse to gain firsthand insights into operations.",  "Contributed to presales projects across a diverse range of companies spanning retail, food and beverages, and manufacturing sectors."]
    }
  ],
  "volunteer": [
    {
      "organization": "Start2jog",
      "location": "Hadfield",
      "position": "Cross country capatain",
      "url": "",
      "startDate": "2019-09-01",
      "endDate": "",
      "summary": "I organise my running clubs' participation in the Manchester Area Cross Country League.",
      "highlights": ["I've introduced 50+ runners to cross country, many had either not ran cross country at all or hadn't run cross country since school days.", "I'm responsible to getting teams together, liasing with the league to register the club and runners, and sharing information about up and coming runs."]
    },
    {
      "organization": "parkrun, UK",
      "location": "Manchester & Glossop",
      "position": "Run Director",
      "url": "",
      "startDate": "2016-11-01",
      "endDate": "2025-01-07",
      "summary": "Part of core teams responsible for providing a safe and inclusive environment for runners to run 5K on a Saturday morning.",
      "highlights": ["Helped to establish Sale Water park, parkun.", "Joined the core team at Glossop parkrun and served as co-event director for a couple of years", "In total run directed 43 times."]
    }
  ],
  "education": [
    {
      "institution": "Lancaster University",
      "location": "Lancaster, UK",
      "url": "",
      "area": "Statistics and Operational Research",
      "studyType": "PhD",
      "startDate": "2012-09-01",
      "endDate": "2013-09-01",
      "score": "",
      "courses": ["Detecting abrupt changes in Big Data"]
    },
    {
      "institution": "Lancaster University",
      "location": "Lancaster, UK",
      "url": "",
      "area": "Statistics and Operational Research",
      "studyType": "MRes",
      "startDate": "2013-09-01",
      "endDate": "2016-12-01",
      "score": ""
    },
    {
      "institution": "Heriot Watt University",
      "location": "Edinburgh, UK",
      "url": "",
      "area": "Maths and Statistics",
      "studyType": "BSc",
      "startDate": "2008-09-01",
      "endDate": "2012-05-01",
      "score": ""
    }
  ],
  "awards": [
    {
      "title": "Jon Ross Award",
      "date": "2023",
      "awarder": "Netacea",
      "url": "",
      "summary": "A peer-nominated recognition for embodying values in knowledge sharing, mentoring, and supporting colleagues to maximize their potential and facilitate career growth."
    },
    {
      "title": "Dean’s award for PhD Excellence",
      "date": "2016",
      "awarder": "Lancaster Universtiy",
      "url": "",
      "summary": "Awarded for my achievements during my 3rd year PhD and for my engagement with other students in the department."
    },
    {
      "title": "Student paper award",
      "date": "2016",
      "awarder": "American Statistical Association Section on Statistical Computing",
      "url": "",
      "summary": "Travel grant awarded to attend JSM 2015 in Seattle to present 'Efficent penalty search for multiple changepoint detection in big data.'"
    },
    {
      "title": "Watt Club medal, Roderick McCallum Prize and Exceptional Contribution Award,",
      "date": "2012",
      "awarder": "Heriot Watt University",
      "url": "",
      "summary": "Awarded at undergraduate graduation for greatest distinction in Mathematics.'"
    }
  ],
  "publications": [
    {
      "name": "Parallelization of a common changepoint detection method",
      "publisher": "Journal of computational and graphical statistics.",
      "authors": "Sam O. Tickle, Kaylea Haynes, Paul Fearnhead, Idris A. Eckley",
      "releaseDate": "2019-09-06",
      "url": "https://www.tandfonline.com/doi/full/10.1080/10618600.2019.1647216",
      "summary": "In recent years, various means of efficiently detecting changepoints have been proposed, with one popular approach involving minimizing a penalized cost function using dynamic programming. In some situations, these algorithms can have an expected computational cost that is linear in the number of data points; however, the worst case cost remains quadratic. We introduce two means of improving the computational performance of these methods, both based on parallelizing the dynamic programming approach. We establish that parallelization can give substantial computational improvements: in some situations the computational cost decreases roughly quadratically in the number of cores used. These parallel implementations are no longer guaranteed to find the true minimum of the penalized cost; however, we show that they retain the same asymptotic guarantees in terms of their accuracy in estimating the number and location of the changes."
    }, 
    {
      "name": "A computationally efficient nonparametric approach for changepoint detection.",
      "publisher": "Statistics and Computing",
      "authors": "Kaylea Haynes, Paul Fearnhead, Idris A. Eckley",
      "releaseDate": "2016-07-28",
      "url": "https://link.springer.com/article/10.1007/s11222-016-9687-5",
      "summary": "In this paper we build on an approach proposed by Zou et al. (2014) for nonpara- metric changepoint detection. This approach defines the best segmentation for a data set as the one which minimises a penalised cost function, with the cost function defined in term of minus a non-parametric log-likelihood for data within each segment. Min- imising this cost function is possible using dynamic programming, but their algorithm had a computational cost that is cubic in the length of the data set. To speed up computation, Zou et al. (2014) resorted to a screening procedure which means that the estimated segmentation is no longer guaranteed to be the global minimum of the cost function. We show that the screening procedure adversely affects the accuracy of the changepoint detection method, and show how a faster dynamic programming algorithm, Pruned Exact Linear Time, PELT (Killick et al., 2012), can be used to find the optimal segmentation with a computational cost that can be close to linear in the amount of data. PELT requires a penalty to avoid under/over-fitting the model which can have a detrimental effect on the quality of the detected changepoints. To overcome this issue we use a relatively new method, Changepoints Over a Range of PenaltieS (CROPS) (Haynes et al., 2015), which finds all of the optimal segmentations for multiple penalty values over a continuous range. We apply our method to detect changes in heart rate during physical activity."
    }, 
    {
      "name": "The fitbit generation: from couch potato to marathon runner",
      "publisher": "Significance magazine",
      "authors": "Kaylea Haynes",
      "releaseDate": "2015-12-6",
      "url": "https://academic.oup.com/jrssig/article/12/6/24/7029032",
      "summary": "Applies changepoint analysis to Fitbit data to optimise her exercise regime."
    }, 
    {
      "name": "Computationally efficient changepoint detection for a range of penalties.",
      "publisher": "Journal of computational and graphical statistics.",
      "authors": "Kaylea Haynes, Idris A. Eckley, Paul Fearnhead",
      "releaseDate": "2014-12-01",
      "url": "https://www.tandfonline.com/doi/full/10.1080/10618600.2015.1116445",
      "summary": "In the multiple changepoint setting, various search methods have been proposed, which involve optimizing either a constrained or penalized cost function over possible numbers and locations of changepoints using dynamic programming. Recent work in the penalized optimization setting has focused on developing an exact pruning-based approach that, under certain conditions, is linear in the number of data points. Such an approach naturally requires the specification of a penalty to avoid under/over-fitting. Work has been undertaken to identify the appropriate penalty choice for data-generating processes with known distributional form, but in many applications the model assumed for the data is not correct and these penalty choices are not always appropriate. To this end, we present a method that enables us to find the solution path for all choices of penalty values across a continuous range. This permits an evaluation of the various segmentations to identify a suitable penalty choice. The computational complexity of this approach can be linear in the number of data points and linear in the difference between the number of changepoints in the optimal segmentations for the smallest and largest penalty values."
    }
  ],
  "skills": [
    {
      "name": "",
      "level": "",
      "icon": "",
      "keywords": [
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker",
      "icon": ""
    }
  ]
}
